# ИСПОЛЬЗОВАТЬ везде: оформление кода согласно PEP 8 — в качестве образца можно использовать код из репозитория _scripts

# В первой строке попросить пользователя ввести целое число.
a = int(input(''))
# Во второй строке выводим следующее целое число.
# ИСПОЛЬЗОВАТЬ везде: PEP 8 рекомендует добавлять пробелы вокруг бинарных операторов
print(f'Следующее за числом {a} число: {a + 1}')
# В третьей строке выводим предыдущее целое число.
print(f'Для числа {a} предыдущее число: {a - 1}')


# 35
# Следующее за числом 35 число: 36
# Для числа 35 предыдущее число: 34

